dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
static volatile float batteryVoltage1 = 0;
static volatile float batteryVoltage2 = 0;

static volatile uint16_t sen1AnalogValue = 0;
static volatile uint16_t sen2AnalogValue = 0;
static volatile uint16_t sen3AnalogValue = 0;
static volatile uint16_t sen4AnalogValue = 0;

static volatile uint32_t internalCounter = 0;

static volatile float roll,pitch,heading = 0;
static volatile float fNormAcc,fSinRoll,fCosRoll,fSinPitch,fCosPitch = 0.0f;
static volatile float accX,accY,accZ = 0;
static volatile float accXFiltered,accYFiltered,accZFiltered = 0;
static volatile float compassX,compassY,compassZ = 0;

static volatile float wheelL1Odometer_m, wheelL1Odometer_m_prev = 0;
static volatile float wheelL2Odometer_m, wheelL2Odometer_m_prev = 0;
static volatile float wheelL3Odometer_m, wheelL3Odometer_m_prev = 0;
static volatile float wheelR1Odometer_m, wheelR1Odometer_m_prev = 0;
static volatile float wheelR2Odometer_m, wheelR2Odometer_m_prev = 0;
static volatile float wheelR3Odometer_m, wheelR3Odometer_m_prev = 0;
static volatile float wheelL1Angle_deg = 0;
static volatile float wheelL2Angle_deg = 0;
static volatile float wheelL3Angle_deg = 0;
static volatile float wheelR1Angle_deg = 0;
static volatile float wheelR2Angle_deg = 0;
static volatile float wheelR3Angle_deg = 0;

static volatile float wheelL1RawVelocity_mps, wheelL1FiltVelocity_mps, wheelL1FiltVelocity_rpm = 0;
static volatile float wheelL2RawVelocity_mps, wheelL2FiltVelocity_mps, wheelL2FiltVelocity_rpm = 0;
static volatile float wheelL3RawVelocity_mps, wheelL3FiltVelocity_mps, wheelL3FiltVelocity_rpm = 0;
static volatile float wheelR1RawVelocity_mps, wheelR1FiltVelocity_mps, wheelR1FiltVelocity_rpm = 0;
static volatile float wheelR2RawVelocity_mps, wheelR2FiltVelocity_mps, wheelR2FiltVelocity_rpm = 0;
static volatile float wheelR3RawVelocity_mps, wheelR3FiltVelocity_mps, wheelR3FiltVelocity_rpm = 0;

static volatile float wheelSize_m = 0.20f; // 20cm circumference [m]
static volatile uint16_t encoderSignalsPerRound = 360; // 3 counts per motor round and a 120:1 gearbox
static volatile uint16_t speedSensingTaskCycle_ms = 10; // 10ms task cycle time
static volatile float distancePerImpulse = 0.20f / 360; // wheelSize_m / encoderSignalsPerRound, [m / tick]
static volatile float anglePerImpulse = 360 / 360; // 360 / encoderSignalsPerRound, [° / tick]

static volatile float referenceSpeedLeft = 0;
static volatile float referenceSpeedRight = 0;

static volatile uint32_t timeStamp =0;
static volatile uint32_t timeOutGuard, timeOutGuardMax =0;
static uint8_t receiveBuffer[10]={0};
static volatile float referenceSpeed = 0;
static volatile float referenceAngle = 0;
static uint8_t messageCounter, messageCounterPrev = 0;
static volatile uint8_t buttonState = 0;

static volatile float nextSpeedLeft, nextSpeedRight = 0;
static volatile float reqSpeedLeft, reqSpeedRight, currSpeedLeft, currSpeedRight = 0;
static volatile float speedRampRate = 0.05;

static volatile float wheelL1VelocityError, wheelL1VelocityErrorBefore, wheelL1VelocityIntError, wheelL1VelocityDerivatedError, wheelL1SumControl, wheelL1SumControlBeforeSaturation = 0;
static volatile float wheelL2VelocityError, wheelL2VelocityErrorBefore, wheelL2VelocityIntError, wheelL2VelocityDerivatedError, wheelL2SumControl, wheelL2SumControlBeforeSaturation = 0;
static volatile float wheelL3VelocityError, wheelL3VelocityErrorBefore, wheelL3VelocityIntError, wheelL3VelocityDerivatedError, wheelL3SumControl, wheelL3SumControlBeforeSaturation = 0;
static volatile float wheelR1VelocityError, wheelR1VelocityErrorBefore, wheelR1VelocityIntError, wheelR1VelocityDerivatedError, wheelR1SumControl, wheelR1SumControlBeforeSaturation = 0;
static volatile float wheelR2VelocityError, wheelR2VelocityErrorBefore, wheelR2VelocityIntError, wheelR2VelocityDerivatedError, wheelR2SumControl, wheelR2SumControlBeforeSaturation = 0;
static volatile float wheelR3VelocityError, wheelR3VelocityErrorBefore, wheelR3VelocityIntError, wheelR3VelocityDerivatedError, wheelR3SumControl, wheelR3SumControlBeforeSaturation = 0;

static volatile float maxDutyCycle = 100;
static volatile float antiWindup = 0.004;
static volatile float ctrlP = 750;
static volatile float ctrlI = 10;
static volatile float ctrlD = 0;

static volatile float positionErrorL3_deg = 0;
static volatile float referenceAngleL3_deg = 0;
static volatile float ctrlP_pos = 0.01;

static volatile uint16_t ultrasonicDebounceLimit = 50;
static volatile uint8_t ultrasonicActive = 0;
static volatile uint8_t bumperActive = 0;
static volatile uint8_t autonomousActive = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_CRC_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
static void MX_I2C3_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM10_Init(void);
static void MX_SPI5_Init(void);
void StartDefaultTask(void const * argument);
void StartSensorTask(void const * argument);
void StartControlTask(void const * argument);
void StartCommTask(void const * argument);
void StartIdleTask(void const * argument);
void StartLedTask(void const * argument);
void StartApplicationTask(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
  
  if(hadc->Instance==ADC1){
    ADC_Values[0] = ADC_Buf[0];
    ADC_Values[1] = ADC_Buf[1];
    ADC_Values[2] = ADC_Buf[2];
    ADC_Values[3] = ADC_Buf[3];
    ADC_Values[4] = ADC_Buf[4];
    ADC_Values[5] = ADC_Buf[5];
  }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

