dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
  /*Configure GPIO pins : RIGHT1_ENC_B_Pin RIGHT2_ENC_B_Pin */
  GPIO_InitStruct.Pin = RIGHT1_ENC_B_Pin|RIGHT2_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_ENC_B_Pin LEFT2_ENC_B_Pin LEFT3_ENC_B_Pin */
  GPIO_InitStruct.Pin = LEFT1_ENC_B_Pin|LEFT2_ENC_B_Pin|LEFT3_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : LEFT1_FW_Pin */
  GPIO_InitStruct.Pin = LEFT1_FW_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LEFT1_FW_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SEN3_EXTI_Pin SEN4_EXTI_Pin SEN1_EXTI_Pin SEN2_EXTI_Pin */
  GPIO_InitStruct.Pin = SEN3_EXTI_Pin|SEN4_EXTI_Pin|SEN1_EXTI_Pin|SEN2_EXTI_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : RIGHT3_ENC_B_Pin */
  GPIO_InitStruct.Pin = RIGHT3_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(RIGHT3_ENC_B_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_RW_Pin RIGHT3_FW_Pin RIGHT3_RW_Pin LD5_Pin 
                           LD6_Pin */
  GPIO_InitStruct.Pin = LEFT1_RW_Pin|RIGHT3_FW_Pin|RIGHT3_RW_Pin|LD5_Pin 
                          |LD6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_EXTI0_Pin LEFT2_EXTI1_Pin LEFT3_EXTI2_Pin RIGHT1_EXTI3_Pin 
                           RIGHT2_EXTI4_Pin RIGHT3_EXTI5_Pin */
  GPIO_InitStruct.Pin = LEFT1_EXTI0_Pin|LEFT2_EXTI1_Pin|LEFT3_EXTI2_Pin|RIGHT1_EXTI3_Pin 
                          |RIGHT2_EXTI4_Pin|RIGHT3_EXTI5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  HAL_NVIC_SetPriority(EXTI1_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI1_IRQn);

  HAL_NVIC_SetPriority(EXTI2_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);

  HAL_NVIC_SetPriority(EXTI3_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);

  HAL_NVIC_SetPriority(EXTI4_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
  switch ( GPIO_Pin ) {
  case GPIO_PIN_0:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_12)) mot1Cntr++;
    else mot1Cntr--;
    break;
  case GPIO_PIN_1:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_13)) mot2Cntr++;
    else mot2Cntr--;
    break;
  case GPIO_PIN_2:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_14)) mot3Cntr++;
    else mot3Cntr--;
    break;
  case GPIO_PIN_3:
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_7)) mot4Cntr++;
    else mot4Cntr--;
    break;
  case GPIO_PIN_4:
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_8)) mot5Cntr++;
    else mot5Cntr--;
    break;
  case GPIO_PIN_5:
    if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10)) mot6Cntr++;
    else mot6Cntr--;
    break;
  case GPIO_PIN_6:
    if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_6))
    {
        ultrasound_onSenseStart(&sensors[0], TIM10->CNT);
    }
    else
    {
        ultrasound_onSenseEnd(&sensors[0], TIM10->CNT);
    }
    break; 
  case GPIO_PIN_7:
    if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_7))
    {
        ultrasound_onSenseStart(&sensors[1], TIM10->CNT);
    }
    else
    {
        ultrasound_onSenseEnd(&sensors[1], TIM10->CNT);
    }
    break; 
  case GPIO_PIN_8:
      if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_8))
      {
          ultrasound_onSenseStart(&sensors[2], TIM10->CNT);
      }
      else
      {
          ultrasound_onSenseEnd(&sensors[2], TIM10->CNT);
      }
    break; 
  case GPIO_PIN_9:
      if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_9))
      {
          ultrasound_onSenseStart(&sensors[3], TIM10->CNT);
      }
      else
      {
          ultrasound_onSenseEnd(&sensors[3], TIM10->CNT);
      }
    break; 
  default:
    break;
  }
}

float filter2 (float avg, float input, float alpha) {
  return (alpha * input) + (1.0f - alpha) * avg;
}

void saturateInteger(int16_t* i, int16_t min, int16_t max) {
  int16_t val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

float saturateFloat(float i, float min, float max)
{
    float val;

    if (i < min)
    {
      val = min;
    }
    else if (i > max)
    {
      val = max;
    }
    else
    {
      val = i;
    }

    return val;
}

void calculateLRSpeeds(float r, float phiDeg) {

  float phiRad = phiDeg * (M_PI / 180.0f);
  
  if ((phiRad >= 0) && (phiRad < M_PI_2)) //1st quadrant
  {
      referenceSpeedLeft = r;
      referenceSpeedRight = -r * cosf(2 * phiRad);
  }
  else if ((phiRad >= M_PI_2) && (phiRad < M_PI)) //2nd quadrant
  {
      referenceSpeedLeft = -r * cosf(2 * phiRad);
      referenceSpeedRight = r;
  }
  else if ((phiRad >= M_PI) && (phiRad < 3 * M_PI_2)) //3rd quadrant
  {
      referenceSpeedLeft = -r;
      referenceSpeedRight = r * cosf(2 * phiRad);
  }
  else if ((phiRad >= 3 * M_PI_2) && (phiRad < M_2_PI)) //4th quadrant
  {
      referenceSpeedLeft = r * cosf(2 * phiRad);
      referenceSpeedRight = -r;
  }
}

void processButtons(uint8_t buttons){
  if ((buttons & 0x01) == 0x01){
    referenceAngleL3_deg += 1;
  }
  if ((buttons & 0x04) == 0x04){
    referenceAngleL3_deg -= 1;
  }
  
  if ((buttons & 0x10) == 0x10){
    autonomousActive = 1;
  }
  else {
    autonomousActive = 0;
  }

  //else{
  //  //referenceAngleL3_deg = wheelL3Angle_deg;
  //}
}
/* USER CODE END 4 */

