dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartSensorTask */
/**
* @brief Function implementing the sensorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSensorTask */
void StartSensorTask(void const * argument)
{
  /* USER CODE BEGIN StartSensorTask */
  uint32_t cycleCounter = 0;
  
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC_Buf,6);
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    //test code START
    mot1Dir = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_12);
    mot2Dir = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_13);
    mot3Dir = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_14);
    mot4Dir = HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_7);
    mot5Dir = HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_8);
    mot6Dir = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);
    internalCounter = TIM10->CNT;
    //test code END
    vTaskDelayUntil(&xLastWakeTime, speedSensingTaskCycle_ms);
    cycleCounter++;
    
    for (uint8_t i = 0u; i < sizeof(sensors) / sizeof(sensors[0]); i++)
    {
        const float ultrasoundSmoothingCoeff = 0.2f;
        const float ultrasoundTimeToDistanceCoeff = 0.34f / 2;
        sensors[i].rawDistance = sensors[i].length * ultrasoundTimeToDistanceCoeff;

        if (sensors[i].rawDistance == sensors[i].previousDistance)
        {
            if (sensors[i].debounceCounter < 1000u)
            {
                sensors[i].debounceCounter++;
            }
        }
        else
        {
            sensors[i].debounceCounter = 0u;
        }
        sensors[i].previousDistance = sensors[i].rawDistance;
        sensors[i].filteredDistance = filter2(sensors[i].filteredDistance, sensors[i].rawDistance, ultrasoundSmoothingCoeff);
    }
    
    batteryVoltage1 = ADC_Values[0]*3.0*10/4095;
    batteryVoltage2 = ADC_Values[1]*3.0*10/4095;
    sen1AnalogValue = ADC_Values[2];
    sen2AnalogValue = ADC_Values[3];
    sen3AnalogValue = ADC_Values[4];
    sen4AnalogValue = ADC_Values[5];

    /* Update wheel 1 */
    int32_t dcntr1 = mot1Cntr - mot1CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr1 > 32000)
    {
        dcntr1 -= 65536;
    }
    else if (dcntr1 < -32000)
    {
        dcntr1 += 65536;
    }
    wheelL1Odometer_m += dcntr1 * distancePerImpulse;
    wheelL1Angle_deg += dcntr1 * anglePerImpulse;

    /* Update wheel 2 */
    int32_t dcntr2 = mot2Cntr - mot2CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr2 > 32000)
    {
        dcntr2 -= 65536;
    }
    else if (dcntr2 < -32000)
    {
        dcntr2 += 65536;
    }
    wheelL2Odometer_m += dcntr2 * distancePerImpulse;
    wheelL2Angle_deg += dcntr2 * anglePerImpulse;

    /* Update wheel 3 */
    int32_t dcntr3 = mot3Cntr - mot3CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr3 > 32000)
    {
        dcntr3 -= 65536;
    }
    else if (dcntr3 < -32000)
    {
        dcntr3 += 65536;
    }
    wheelL3Odometer_m += dcntr3 * distancePerImpulse;
    wheelL3Angle_deg += dcntr3 * anglePerImpulse;

    /* Update wheel 4 */
    int32_t dcntr4 = mot4Cntr - mot4CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr4 > 32000)
    {
        dcntr4 -= 65536;
    }
    else if (dcntr4 < -32000)
    {
        dcntr4 += 65536;
    }
    wheelR1Odometer_m += dcntr4 * distancePerImpulse;
    wheelR1Angle_deg += dcntr4 * anglePerImpulse;

    /* Update wheel 5 */
    int32_t dcntr5 = mot5Cntr - mot5CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr5 > 32000)
    {
        dcntr5 -= 65536;
    }
    else if (dcntr5 < -32000)
    {
        dcntr5 += 65536;
    }
    wheelR2Odometer_m += dcntr5 * distancePerImpulse;
    wheelR2Angle_deg += dcntr5 * anglePerImpulse;

    /* Update wheel 6 */
    int32_t dcntr6 = mot6Cntr - mot6CntrPrev;
    /* Assume that an overflow has happened and fix it */
    if (dcntr6 > 32000)
    {
        dcntr6 -= 65536;
    }
    else if (dcntr6 < -32000)
    {
        dcntr6 += 65536;
    }
    wheelR3Odometer_m += dcntr6 * distancePerImpulse;
    wheelR3Angle_deg += dcntr6 * anglePerImpulse;
    
    
    wheelL1RawVelocity_mps = (wheelL1Odometer_m - wheelL1Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;
    wheelL2RawVelocity_mps = (wheelL2Odometer_m - wheelL2Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;
    wheelL3RawVelocity_mps = (wheelL3Odometer_m - wheelL3Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;
    wheelR1RawVelocity_mps = (wheelR1Odometer_m - wheelR1Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;
    wheelR2RawVelocity_mps = (wheelR2Odometer_m - wheelR2Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;
    wheelR3RawVelocity_mps = (wheelR3Odometer_m - wheelR3Odometer_m_prev) * 1000.0 / speedSensingTaskCycle_ms;

    wheelL1FiltVelocity_mps = filter2(wheelL1FiltVelocity_mps, wheelL1RawVelocity_mps, 0.35);
    wheelL2FiltVelocity_mps = filter2(wheelL2FiltVelocity_mps, wheelL2RawVelocity_mps, 0.35);
    wheelL3FiltVelocity_mps = filter2(wheelL3FiltVelocity_mps, wheelL3RawVelocity_mps, 0.35);
    wheelR1FiltVelocity_mps = filter2(wheelR1FiltVelocity_mps, wheelR1RawVelocity_mps, 0.35);
    wheelR2FiltVelocity_mps = filter2(wheelR2FiltVelocity_mps, wheelR2RawVelocity_mps, 0.35);
    wheelR3FiltVelocity_mps = filter2(wheelR3FiltVelocity_mps, wheelR3RawVelocity_mps, 0.35);
    
    wheelL1FiltVelocity_rpm = wheelL1FiltVelocity_mps / wheelSize_m * 360 / 6;
    wheelL2FiltVelocity_rpm = wheelL2FiltVelocity_mps / wheelSize_m * 360 / 6;
    wheelL3FiltVelocity_rpm = wheelL3FiltVelocity_mps / wheelSize_m * 360 / 6;
    wheelR1FiltVelocity_rpm = wheelR1FiltVelocity_mps / wheelSize_m * 360 / 6;
    wheelR2FiltVelocity_rpm = wheelR2FiltVelocity_mps / wheelSize_m * 360 / 6;
    wheelR3FiltVelocity_rpm = wheelR3FiltVelocity_mps / wheelSize_m * 360 / 6;
    
