dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    if (fabsf(nextSpeedLeft) < 0.01) {
      wheelL1VelocityIntError -= wheelL1VelocityIntError*0.01;
      wheelL2VelocityIntError -= wheelL2VelocityIntError*0.01;
      wheelL3VelocityIntError -= wheelL3VelocityIntError*0.01;
    }
    if (fabsf(nextSpeedRight) < 0.01) {
      wheelR1VelocityIntError -= wheelR1VelocityIntError*0.01;
      wheelR2VelocityIntError -= wheelR2VelocityIntError*0.01;
      wheelR3VelocityIntError -= wheelR3VelocityIntError*0.01;
    }
    
    wheelL1SumControl = saturateFloat(wheelL1SumControl, -maxDutyCycle, maxDutyCycle);
    wheelL2SumControl = saturateFloat(wheelL2SumControl, -maxDutyCycle, maxDutyCycle);
    wheelL3SumControl = saturateFloat(wheelL3SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR1SumControl = saturateFloat(wheelR1SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR2SumControl = saturateFloat(wheelR2SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR3SumControl = saturateFloat(wheelR3SumControl, -maxDutyCycle, maxDutyCycle);

    MotorControl_SetSpeed(&motors[MOTOR_LEFT1], (int32_t) wheelL1SumControl);
    MotorControl_SetSpeed(&motors[MOTOR_LEFT2], (int32_t) wheelL2SumControl);
    MotorControl_SetSpeed(&motors[MOTOR_LEFT3], (int32_t) wheelL3SumControl);
    
    MotorControl_SetSpeed(&motors[MOTOR_RIGHT1], (int32_t) wheelR1SumControl);
    MotorControl_SetSpeed(&motors[MOTOR_RIGHT2], (int32_t) wheelR2SumControl);
    MotorControl_SetSpeed(&motors[MOTOR_RIGHT3], (int32_t) wheelR3SumControl);

    currSpeedLeft = nextSpeedLeft;
    currSpeedRight = nextSpeedRight;

    vTaskDelayUntil(&xLastWakeTime, 20u);
  }
  /* USER CODE END StartControlTask */
}

/* USER CODE BEGIN Header_StartCommTask */
/**
* @brief Function implementing the commTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCommTask */
void StartCommTask(void const * argument)
{
  /* USER CODE BEGIN StartCommTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    HAL_UART_Receive_IT(&huart6,receiveBuffer,5);
    
    if ((receiveBuffer[0] == 0xFF) && (receiveBuffer[1] <=100) && (receiveBuffer[2] <=180)){
      //referenceSpeedOrig = receiveBuffer[1] / 10.0;
      //referenceSpeed = calcSpdRef_LUT(referenceSpeedOrig);
      referenceSpeed = receiveBuffer[1] / 667.0;
      referenceAngle = receiveBuffer[2] * 2.0;
      buttonState = receiveBuffer[3];
      messageCounter = receiveBuffer[4];
      if (messageCounter != messageCounterPrev){
        timeStamp = HAL_GetTick();
        messageCounterPrev = messageCounter;
      }
    }    
    
    timeOutGuard = HAL_GetTick() - timeStamp;
    if (timeOutGuard > timeOutGuardMax){
      timeOutGuardMax = timeOutGuard;
    }
    
    if ((timeOutGuard) > 1000){
      referenceSpeed = 0;
      referenceAngle = 0;
      buttonState = 0;
    }
    
    vTaskDelayUntil(&xLastWakeTime, 20u);
  }
  /* USER CODE END StartCommTask */
}

/* USER CODE BEGIN Header_StartIdleTask */
/**
* @brief Function implementing the idleTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartIdleTask */
void StartIdleTask(void const * argument)
{
  /* USER CODE BEGIN StartIdleTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1000);
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
  }
  /* USER CODE END StartIdleTask */
}

/* USER CODE BEGIN Header_StartLedTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLedTask */
void StartLedTask(void const * argument)
{
  /* USER CODE BEGIN StartLedTask */
  uint8_t cycleCounter=0;
  uint32_t roundCounter = 0;
  int8_t bluetoothBlinkCounter = 0;
  int8_t battery1BlinkCounter = 0;
  int8_t battery2BlinkCounter = 0;
  
  float voltageFullRange_Mot = NORMALVOLTAGE_MOT - LOWVOLTAGE_MOT;
  float voltageFullRange_Logic = NORMALVOLTAGE_LOGIC - LOWVOLTAGE_LOGIC;
  float voltageInRange = 0;
  float voltageRatio = 0;
  float cellVoltage = 0;
  
  WS2812_One_RGB(0,(WS2812_RGB_t){0,10,0},0);
  WS2812_One_RGB(1,(WS2812_RGB_t){10,10,10},0);
  WS2812_One_RGB(2,(WS2812_RGB_t){10,0,0},0);
  WS2812_One_RGB(3,(WS2812_RGB_t){10,10,0},0);
  WS2812_One_RGB(4,(WS2812_RGB_t){0,0,10},1);
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    cycleCounter++;
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
    
    if (bumperActive){
      WS2812_All_RGB((WS2812_RGB_t){10,0,0},0);
    }
    else if (ultrasonicActive){
      WS2812_All_RGB((WS2812_RGB_t){0,10,0},0);
    }
    else {
      WS2812_All_RGB((WS2812_RGB_t){0,0,0},0);
      WS2812_One_RGB(((roundCounter%12)+4),(WS2812_RGB_t){0,0,10},0);
      roundCounter++;
      WS2812_Revvy_Shift_Right(0);
    }
    
    
    
    WS2812_One_RGB(0,(WS2812_RGB_t){30,30,30},0);

    if ((timeOutGuard) > 1000){
      if ((bluetoothBlinkCounter >= 0) && (bluetoothBlinkCounter < 3)) WS2812_One_RGB(1,(WS2812_RGB_t){0,0,30},0);
      else if ((bluetoothBlinkCounter >= 3) && (bluetoothBlinkCounter < 7)) WS2812_One_RGB(1,(WS2812_RGB_t){0,0,0},0);
      if (bluetoothBlinkCounter == 6) bluetoothBlinkCounter = -1;
      bluetoothBlinkCounter++;
    }
    else{
      WS2812_One_RGB(1,(WS2812_RGB_t){0,0,30},0);
    }
    
    cellVoltage = batteryVoltage1 / 4;
    if (cellVoltage >= NORMALVOLTAGE_LOGIC){
      WS2812_One_RGB(2,(WS2812_RGB_t){0,30,0},0);
    }
    else if ((cellVoltage < NORMALVOLTAGE_LOGIC) && (cellVoltage >= LOWVOLTAGE_LOGIC)){
      voltageInRange = cellVoltage - LOWVOLTAGE_LOGIC;
      voltageRatio = voltageInRange / voltageFullRange_Logic;
      WS2812_One_RGB(2,(WS2812_RGB_t){(int)(30*(1-voltageRatio)),(int)(30*(voltageRatio)),0},0);
    }
    else if (cellVoltage < LOWVOLTAGE_LOGIC){
      if (battery1BlinkCounter == 0) WS2812_One_RGB(2,(WS2812_RGB_t){30,0,0},0);
      else if (battery1BlinkCounter == 2) WS2812_One_RGB(2,(WS2812_RGB_t){0,0,0},0);
      else if (battery1BlinkCounter == 4) battery1BlinkCounter = -1;
      battery1BlinkCounter++;
    }
    else {
      WS2812_One_RGB(2,(WS2812_RGB_t){30,30,30},0);
    }
    
    cellVoltage = batteryVoltage2 / 4;
    if (cellVoltage >= NORMALVOLTAGE_MOT){
      WS2812_One_RGB(3,(WS2812_RGB_t){0,30,0},0);
    }
    else if ((cellVoltage < NORMALVOLTAGE_MOT) && (cellVoltage >= LOWVOLTAGE_MOT)){
      voltageInRange = cellVoltage - LOWVOLTAGE_MOT;
      voltageRatio = voltageInRange / voltageFullRange_Mot;
      WS2812_One_RGB(3,(WS2812_RGB_t){(int)(30*(1-voltageRatio)),(int)(30*(voltageRatio)),0},0);
    }
    else if (cellVoltage < LOWVOLTAGE_MOT){
      if (battery2BlinkCounter == 0) WS2812_One_RGB(3,(WS2812_RGB_t){30,0,0},0);
      else if (battery2BlinkCounter == 2) WS2812_One_RGB(3,(WS2812_RGB_t){0,0,0},0);
      else if (battery2BlinkCounter == 4) battery2BlinkCounter = -1;
      battery2BlinkCounter++;
    }
    else {
      WS2812_One_RGB(3,(WS2812_RGB_t){30,30,30},0);
    }
    
    WS2812_Refresh();
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);

