dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    vTaskDelayUntil(&xLastWakeTime, 150u);
  }
  /* USER CODE END StartLedTask */
}

/* USER CODE BEGIN Header_StartApplicationTask */
/**
* @brief Function implementing the applicationTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartApplicationTask */
void StartApplicationTask(void const * argument)
{
  /* USER CODE BEGIN StartApplicationTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    if (autonomousActive){
      referenceAngle = 90;
      referenceSpeed = 0.08;
    }
    
    if (((sensors[0].filteredDistance < 20) && (sensors[0].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[1].filteredDistance < 20) && (sensors[1].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[2].filteredDistance < 20) && (sensors[2].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[3].filteredDistance < 20) && (sensors[3].debounceCounter < ultrasonicDebounceLimit))){
      ultrasonicActive = 1;
      referenceAngle = 180;
      referenceSpeed = 0.1;
    }
    else {
      ultrasonicActive = 0;
    }
    
    
    if ((sen1AnalogValue > 100) || (sen2AnalogValue > 100) || (sen3AnalogValue > 100) || (sen4AnalogValue > 100)){
      bumperActive = 1;
      referenceAngle = 90;
      referenceSpeed = 0.05;
    }
    else {
      bumperActive = 0;
    }
    
    calculateLRSpeeds(referenceSpeed, referenceAngle);
    processButtons(buttonState);

    vTaskDelayUntil(&xLastWakeTime, 10u);
  }
  /* USER CODE END StartApplicationTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM11 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM11) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  while(1);
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
